Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/vocational_education_and_training/fas_training_programmes_and_supports/fas_training_courses.html.txt.tmx
Source language: en
Languages: ga

source: Further Education and Training (FET) courses
ga: Cúrsaí oiliúna Breisoideachais agus Oiliúna (BOO)

source: Further Education and Training (FET) training courses are provided in Education and Training Board (ETB) Training Centres
ga: Soláthraítear cúrsaí oiliúna Breisoideachais agus Oiliúna (BOO) in Ionaid Oiliúna Breisoideachais agus Oiliúna (BOO)

source: If you are unemployed or redundant or if you wish to update your skills or change your career, there is a wide range of training courses available to assist you
ga: Má tá tú dífhostaithe nó iomarcach agus más mian leat do scileanna a nuashonrú nó do ghairm a athrú, tá raon leathan cúrsaí Breisoideachais agus Oiliúna (FET) ar fáil chun cabhrú leat

source: You are eligible to take part in a FET training course if you are unemployed, redundant or no longer in full-time education
ga: Tá tú incháilithe chun páirt a ghlacadh i gcúrsa oiliúna BOO má tá tú dífhostaithe, má rinneadh iomarcach thú nó mura bhfuil tú in oideachas lánaimseartha a thuilleadh

source: You may also be eligible if you are getting a disability-related social welfare payment or a One-Parent Family Payment
ga: Má fhaigheann tú íocaíocht leasa shóisialaigh a bhaineann le míchumas nó Íocaíocht Teaghlaigh Aontuismitheora, d'fhéadfá a bheith i dteideal tabhairt faoi chúrsa freisin

source: FÁS, SOLAS and ETBs
ga: FÁS, SOLAS agus Boird Oideachais agus Oiliúna

source: FÁS was dissolved and some of its functions were transferred to SOLAS - the new further education and training authority
ga: Rinneadh FÁS a dhíscaoileadh agus aistríodh cuid dá fheidhmeanna go dtí SOLAS – an t-údarás nua breisoideachais agus oiliúna

source: In 2014, the FÁS training division transfered to the Education and Training Boards (ETBs) which replaced VECs
ga: In 2014, aistríodh rannóg oiliúna FÁS chuig na Boird Oideachais agus Oiliúna (BOOanna) a tháinig in ionad Coistí Gairmoideachais

source: There are training courses available under 2 different types of training
ga: Tá cúrsaí oiliúna ar fáil faoi 2 shaghas éagsúla d’oiliúint

source: The Traineeship Programme provides training and relevant work experience
ga: Cuireann an Clár Cúrsaí Oiliúna oiliúint agus taithí ábhartha oibre ar fáil

source: If you are unemployed and looking for an opportunity to gain training, experience and a formal qualification in a particular area of work, the Traineeship Programme may suit your needs
ga: Má tá tú dífhostaithe agus má tá deis á cuardach agat chun oiliúint, taithí agus cáilíocht fhoirmiúil a bhaint amach i limistéar áirithe oibre, d’fhéadfadh go n-oirfeadh an Clár Oiliúna do chuid riachtanas

source: The duration of the programme will depend on the area in which you choose to train
ga: Braithfidh fad an chláir ar an limistéar ina roghnaíonn tú tabhairt faoi oiliúint

source: When your initial training is completed, you move back and forth between the centre and the employer's workplace, further developing your skills and gaining practical experience
ga: Nuair a bheidh d’oiliúint tosaigh críochnaithe, beidh tú ag tabhairt faoi oiliúint san ionad agus faoi thaithí oibre in ionad oibre an fhostóra, agus déanann seo breis forbartha ar do chuid scileanna agus cabhraíonn sé leat taithí phraiticiúil a fháil chomh maith

source: When you complete your course you will receive a Qualification and Quality Ireland (QQI) award at either Certificate or Advanced Certificate level
ga: Nuair a chríochnaíonn tú do chúrsa, bronnfar dámhachtain de chuid Dhearbhú Cáilíochta agus Cáilíochtaí Éireann (QQI) ort ar leibhéal Teastais nó Ard-Teastais

source: The range of traineeships available is likely to change so you need to keep in touch with your local employment services office or Intreo centre for up-to-date information
ga: Tharlódh go n-athrófaí an réimse cúrsaí oiliúna atá ar fáil, mar sin, teastaíonn uait teagmháil a choimeád le d’oifig áitiúil seirbhísí fostaíochta chun teacht ar fhaisnéis atá cothrom le dáta

source: Specific Skills Training allows people who have lost their job or who are changing job to learn new job-related skills
ga: Ceadaíonn Oiliúint Scileanna Sonracha do dhaoine a chaill a bpost nó a bhfuil a bpost á athrú acu scileanna nua poist a fhoghlaim

source: There are short and long day courses, online courses, blended learning and evening courses.The courses on offer vary from centre to centre and from year to year with different levels of certification
ga: Tá cúrsaí lae gearrthréimhseach agus fadtréimhseach, cúrsaí ar líne, foghlaim chumaisc agus cúrsaí tráthnóna ar fáil. Bíonn na cúrsaí atá ar fáil éagsúil óna chéile ó ionad go hionad agus ó bhliain go bliain agus sonraítear iontu leibhéil éagsúla deimhnithe

source: The courses are run during the day and in the evenings
ga: Cuirtear na cúrsaí ar siúl i rith an lae agus sa tráthnóna

source: Priority on daytime courses is given to unemployed people
ga: Tugtar tús áite ar chúrsaí lae do dhaoine dífhostaithe

source: A day course is free to all unemployed people, even if you are not getting a social welfare payment
ga: Ní ghearrtar aon táille ar chúrsa lae i gcás daoine dífhostaithe, fiú mura bhfuil íocaíocht leasa shóisialaigh á fáil agat

source: An evening course is not free unless you are getting a social welfare payment
ga: Gearrtar táille ar chúrsa tráthnóna, mura bhfuil íocaíocht leasa shóisialaigh á fáil agat

source: Further Education and Training (FET) training allowances
ga: Liúntais Bhreisoideachais agus Oiliúna (FET)

source: A FET training allowance may be paid if you take part in the Traineeship Programme or Specific Skills Training
ga: Féadfar liúntas oiliúna FET a íoc má ghlacann tú páirt sa Chlár Oiliúna nó in Oiliúint Sainscileanna

source: Apart from evening courses, all FET training courses are free and you may be paid a FET training allowance for the duration of your course
ga: Seachas cúrsaí tráthnóna, tá gach cúrsa oiliúna BOO saor in aisce agus b’fhéidir go n-íocfar liúntas oiliúna BOO leat d’fhad do chúrsa

source: You can also claim a meal allowance, an accommodation allowance if you need to live away from home for the duration of the course or a travel allowance if you live 5 km or more from the course centre
ga: Sa mhullach air sin, is féidir leat liúntas cóiríochta a éileamh má tá ort cónaí amach ón mbaile d’fhad an chúrsa nó liúntas taistil a éileamh má chónaíonn tú 5km nó níos faide ó ionad an chúrsa

source: You may also qualify for free childcare
ga: Sa bhreis air sin, d’fhéadfá cáiliú do chúram leanaí saor in aisce

source: You can read more details in our document on FET training allowances
ga: Is féidir tuilleadh faisnéise a léamh inár gcáipéis maidir le liúntais oiliúna FET

source: To apply for a place on a FET training course, you should register with your local employment services office or Intreo centre
ga: Chun iarratas a dhéanamh ar chúrsa oiliúna BOO, ba cheart duit clárú le d’oifig áitiúil seirbhísí fostaíochta nó d’ionad Intreo

source: You will be interviewed to identify the course that will best suit your needs
ga: Cuirfear agallamh ort chun an cúrsa a shainaithint is fearr a oirfidh do do chuid riachtanas

source: Due to the pressure on some courses, you may not get a place immediately on the course of your choice
ga: Mar gheall ar an mbrú atá ar roinnt cúrsaí, b’fhéidir nach bhfaighidh tú áit láithreach bonn ar do rogha cúrsa

source: For more information about available training courses contact your ETB Training Centre
ga: Chun teacht ar bhreis faisnéise faoi chúrsaí oiliúna atá ar fáil, déan teagmháil le d’Ionad Oiliúna BOO
